Revit 2027 API
Application.ExtractPartAtomFromFamilyFile Method
 Writes a PartAtom XML from the contents of a family file.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ExtractPartAtomFromFamilyFile(
	string familyFilePath,
	string xmlFilePath
)
Public Sub ExtractPartAtomFromFamilyFile (
	familyFilePath As String,
	xmlFilePath As String
)
public:
void ExtractPartAtomFromFamilyFile(
	String^ familyFilePath,
	String^ xmlFilePath
)
member ExtractPartAtomFromFamilyFile :
        familyFilePath : string *
        xmlFilePath : string -> unit
Parameters
familyFilePath String
The family file to be processed.
xmlFilePath String
The xml file to be saved.
Exceptions
Exception | Condition
ArgumentException |  If 'familyFilePath' or 'xmlFilePath' is null or an empty string or if the family file doesn't exist on disk.
Remarks
 If there is a TXT type catalog next to the family file (a TXT file with the same name as the RFA file), the function will read it as well and process its contents into PartAtom. To extract a PartAtom XML from a family loaded into a document in session, use Family.ExtractPartAtom().
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace